Revit 2026 API

# AnalyticalElementGetReference Method

---

Returns a reference to a given curve within the Analytical Element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference GetReference(
	AnalyticalModelSelector selector
)
```
```vb
Public Function GetReference (
	selector As AnalyticalModelSelector
) As Reference
```
```cpp
public:
Reference^ GetReference(
	AnalyticalModelSelector^ selector
)
```
```fsharp
member GetReference :
        selector : AnalyticalModelSelector -> Reference
```

#### Parameters

selector AnalyticalModelSelector
     Specifies where in the Analytical Element the reference lies.

#### Return Value

Reference Requested reference.

| Exception | Condition |
| --- | --- |
| ArgumentException | selector is not valid for this AnalyticalElement. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AnalyticalElement Class

Autodesk.Revit.DB.Structure Namespace